
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//   НастройкиОтчета - см. ВариантыОтчетов.ОписаниеОтчета.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт

	НастройкиВарианта = 
		ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ДетализацияПосещений, "ДетализацияПосещений");
	НастройкиВарианта.Описание = НСтр(
	"ru = 'Детальный список посещений посетителями. 
	|Аналог формы списка.'");
	НастройкиВарианта.Размещение.Вставить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы());
    
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#КонецЕсли
